# -Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу
# между максимальным и минимальным значением дробной части элементов.
# Пример:
# [1.1, 1.2, 3.1, 5.17, 10.02] => 0.18 или 18
# [4.07, 5.1, 8.2444, 6.98] - 0.91 или 91


def minmax(list):
     max_min = []
     for i in range(len(list)):
         if list[i]%1 != 0:
             max_min.append(list[i]%1)
     return max(max_min) - min(max_min)

list1 = [1.1, 1.2, 3.1, 5.17, 10.02]
result = minmax(list1)
print(f'Разница между максимальной и минимальной дробной части = {result:.2f}')